-- insert : 테이블에 데이터 삽입
-- 문자열은 일반적으로 ''사용 

-- update : 테이블에 데이터를 변경

-- delete : 삭제 

-- select : 조회
-- * 은 모든 컬럼 의미

-- select 조건절(where) 활용
-- 이름이 홍길동 인 글쓴이가 쓴 글 목록을 조회하시오
-- 중복제거 조회 : distinct

-- 정렬 : order by 컬럼명
-- asc : 오름차순, desc : 내림차순, 안붙이면 오름차순(default)
-- 아무런 정렬조건 없이 조회 할 경우에는 pk기준 오름차순

-- 멀티 컬럼 order by : 여러컬럼으로 정렬시에, 먼저 쓴 컬럼 우선 정렬하고, 
-- 중복 시 그 다음 컬럼으로 정렬 적용.

-- 결과 값 개수 제한
-- 가장 최근에 가입한 회원 1명만 조회

-- 별칭(allias)를 이용한 select

-- null을 조회조건으로 활용

-- 프로그래머스 sql 문제풀이
-- 여러 기준으로 정렬 하기

-- 상위 n개 레코드
